In [1]:
import pandas as pd

In [2]:
csv = "Resources/salary.csv"

salary_table = pd.read_csv(csv)
salary_table.head()

,Register Value,Player Name,Salary,Season Start,Season End,Team,Full Team Name
0,1,A.C. Green,1750000,1990,1991,LAL,Los Angeles Lakers
1,354,A.C. Green,1750000,1991,1992,LAL,Los Angeles Lakers
2,727,A.C. Green,1750000,1992,1993,LAL,Los Angeles Lakers
3,1103,A.C. Green,1885000,1993,1994,PHO,Phoenix Suns
4,1497,A.C. Green,6472600,1994,1995,PHO,Phoenix Suns

In [3]:
salary_table = salary_table.drop(columns=['Full Team Name'], axis=1)

In [4]:
salary_table.columns

Index(['Register Value', 'Player Name', 'Salary', 'Season Start', 'Season End',
       'Team'],
      dtype='object')

In [5]:
salary_table = salary_table.rename(columns={"Register Value": "salary_id",
                                            "Player Name": "player_id",
                                            "Salary": "salary",
                                            "Season Start": "start_season",
                                            "Season End": "end_season",
                                            "Team": "id_team"}).dropna(how='all')
salary_table.head()

   salary_id   player_id   salary  start_season  end_season id_team
0          1  A.C. Green  1750000          1990        1991     LAL
1        354  A.C. Green  1750000          1991        1992     LAL
2        727  A.C. Green  1750000          1992        1993     LAL
3       1103  A.C. Green  1885000          1993        1994     PHO
4       1497  A.C. Green  6472600          1994        1995     PHO

In [6]:
salary_table.columns

Index(['salary_id', 'player_id', 'salary', 'start_season', 'end_season',
       'id_team'],
      dtype='object')

In [7]:
salary_table = salary_table.astype({'salary_id': int,
                                    'player_id': str,
                                    'salary': float,
                                    'start_season': int,
                                    'end_season': int,
                                    'id_team': str}, errors="ignore")
salary_table.dtypes

salary_id         int32
player_id        object
salary          float64
start_season      int32
end_season        int32
id_team          object
dtype: object